package hh

/*

Моя личная ссылка на мое резюме
https://bryansk.hh.ru/resume/4ce57643ff074efda60039ed1f6f345961346f#key-skills


Golang-разработчик

    написание проектов и программ на Go;
    отладка, тестирование и оптимизация приложений;
    разработка архитектуры приложений с учетом принципов SOLID;
	работа с микросервисной архитектурой;
    работа с базами данных PostgreSQL, Tarantool, ClickHouse, Redis;
	написание SQL запросов и их оптимизация;
	работа с файловой системой;
	работа с очередями сообщений;
	получение данных по сети и их парсинг;
    работа с grpc;
	работа по анализу сетевого трафика;
    разработка многопоточных приложений;
    работа с Linux и командной строкой;
    использование Git и Docker;
	использование очереди задач;
	написание и использование скриптов на lua;
	создание, обучение и использование нейронных сетей;
	работа c vpn серверами;


Разработчик обладает следующими профессиональными навыками:

    отлично знаю язык Go и способен быстро на нём работать;
    способен собирать, тестировать и развёртывать готовые приложения;
    понимаю принципы работы операционных систем и обмена данными по сети;
    использую системы контроля версий;
    способен применять алгоритмы поиска и сортировки;
	в работе использую различные структуры данных;
    активно работаю с базами данных;
    пишу программы под разные ОС;
    умение работать в коллективе;
    способен чётко доносить свои мысли;
    умею слушать и работать над ошибками;
    способен спокойно воспринимать критику и совершенствоваться;
	открыт ко всему новому;

У программиста должны быть развиты следующие качества:

- усидчивость;
- внимание к мелким деталям;
- аналитический склад ума;
- желание постоянно развиваться;
- высокий интеллект;
- дипломатичность;
- ответственность;
- пунктуальность;
- коммуникабельность;
- высокий уровень самодисциплины;

*/
